In [74]:
import pandas as pd

In [82]:

df = pd.read_csv('./my_data.csv')

In [83]:
df.columns

Index(['Unnamed: 0', 'name', 'age', 'salary'], dtype='object')

In [84]:
# 1. Unnamed:0라고 표기되는 열을 지운다. 단 Unnamed:0라 쓰지말고 새롭게 컬럼 이름을 만들어서 지운다.
df.rename(columns={'Unnamed: 0': 'number'}, inplace=True)

df.drop(columns=['number'], inplace=True)

# 출력
df

      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    james   30  400000
4    Alice   25   50000
5      Bob   30   60000
6  Charlie   35   70000
7    james   30  400000

In [85]:
# 2. 0,1,2,3,4로 보여지는 index 부분을 지운다.
df.set_index('name', inplace=True)

In [86]:
df

         age  salary
name
Alice     25   50000
Bob       30   60000
Charlie   35   70000
james     30  400000
Alice     25   50000
Bob       30   60000
Charlie   35   70000
james     30  400000

In [87]:
df.columns

Index(['age', 'salary'], dtype='object')

In [90]:
# 3. name에 해당되는 영문 이름을 한글로 바꾼다.
name_map = {
    'Alice': '앨리스',
    'Bob': '밥',
    'Charlie': '찰리',
    'james': '제임스'
}

df.rename(index=name_map, inplace=True)

In [92]:
df

      age  salary
name
앨리스    25   50000
밥      30   60000
찰리     35   70000
제임스    30  400000
앨리스    25   50000
밥      30   60000
찰리     35   70000
제임스    30  400000

In [93]:
# 4.salary에 해당되는 숫자를 000 세자리 단위로 콤마를 넣어서 값을 바꿔 넣는다.
df['salary'] = df['salary'].apply(lambda x: '{:,.0f}'.format(x))
df

      age   salary
name
앨리스    25   50,000
밥      30   60,000
찰리     35   70,000
제임스    30  400,000
앨리스    25   50,000
밥      30   60,000
찰리     35   70,000
제임스    30  400,000

In [95]:
# 5. 1~4를 처리하고 나서 csv파일로 저장한다
df.to_csv('0801my_data.csv')

In [110]:
df_to = pd.read_csv('./0801my_data.csv', index_col='name')

In [111]:
df_to

      age   salary
name
앨리스    25   50,000
밥      30   60,000
찰리     35   70,000
제임스    30  400,000
앨리스    25   50,000
밥      30   60,000
찰리     35   70,000
제임스    30  400,000